0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  13                                    |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];  // Temperature: K

internalField   uniform 300;  // Room temperature (27°C)

boundaryField
{
    walls
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    
    beamWalls
    {
        type            zeroGradient;
    }
    
    nozzle
    {
        type            zeroGradient;
    }
    
    nozzleInlet
    {
        type            fixedValue;
        value           uniform 300;
    }
    
    beamFrontOpening
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    
    beamBackOpening
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    
    beamHoles
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    
    enclosure
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
}

// ************************************************************************* //
