0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  13                                    |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];  // m²/s³

internalField   uniform 14.855;

boundaryField
{
    walls
    {
        type            inletOutlet;
        inletValue      uniform 14.855;
        value           uniform 14.855;
    }
    
    beamWalls
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    
    nozzle
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    
    nozzleInlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.001;  // 1mm
        value           uniform 14.855;
    }
    
    beamFrontOpening
    {
        type            inletOutlet;
        inletValue      uniform 14.855;
        value           uniform 14.855;
    }
    
    beamBackOpening
    {
        type            inletOutlet;
        inletValue      uniform 14.855;
        value           uniform 14.855;
    }
    
    beamHoles
    {
        type            inletOutlet;
        inletValue      uniform 14.855;
        value           uniform 14.855;
    }
    
    enclosure
    {
        type            inletOutlet;
        inletValue      uniform 14.855;
        value           uniform 14.855;
    }
}

// ************************************************************************* //
